[
  {
    "path": "posts/DataViz Makeover 1/",
    "title": "DataViz Makeover 1 - Merchandise Trade by Region/Market",
    "description": "Explore different approaches to design clear data visualisation with Tableau.\nThis was created as part of the course requirement for ISSS608 Visual Analytics for MITB.",
    "author": [
      {
        "name": "Aaron Oh",
        "url": "https://www.linkedin.com/in/aaronoh743/"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Objectives\r\n3. Evaluation of the original visualisation3.1. Clarity\r\n3.2. Aesthetics\r\n\r\n4. Proposed Graphical Representation4.1. Sketch\r\n4.2. Advatanges of proposed design\r\n\r\n5. Step-by-step description for the makeover5.1. Data Preparation (I)\r\n5.2. Data Preparation (II)\r\n5.3. Creating Visualisations - Imports and Exports\r\n5.4. Creating Visualisations - Net Exports\r\n5.5. Dashboarding - Putting everything together\r\n\r\n6. Observations\r\n\r\n1. Introduction\r\nFor the first DataViz makeover assignment, I will be looking at Merchandise Trade by Region/Market, with data extracted from the Department of Statistics (DOS), Singapore. I will be looking at the import and export numbers from 6 countries - Hong Kong, Mainland China, Japan, Malaysia, Taiwan, US.\r\nThe data is made available under the sub-section of Merchandise Trade by Region/Market.\r\n2. Objectives\r\nThis chart aims to show imports and exports trends of the top six countries historically with the highest trade. This is important as a country’s imports and exports activity can affect her Gross Domestic Product (GDP), exchange rate, inflation and interest rates. By understanding the patterns, policy-makers are able to look into country-specific trade strategies that may overcome any deficits.\r\n3. Evaluation of the original visualisation\r\nI will first examine the original visualisation from the data (Figure 1) and critique based on the clarity and aesthetics.\r\nFigure 1: Original Chart of Merchandise Trade of Top Six Trading Countries, 2019-20203.1. Clarity\r\nChart labels (y-axis) are inconsistent for all six countries. For instance, Hong Kong’s exports uses $2M interval while imports uses $200K interval. This gives an inaccurate first impression that imports have exceeded exports for some months.Similarly, by comparing between countries, it seems that Malaysia and Taiwan have similar imports and exports numbers. Upon closer look, it is observed that Malaysia has twice the amount of exports compared to Taiwan.\r\nThe period (x-axis) presented in the chart is inconsistent with the title. Japan only had data from 2020, while the remaining countries have data presented from 2019-2021. The chart title showed 2019-2020 instead. Nonetheless, the title was clear in showing the reasons for choosing the top six countries.\r\nY-Axis is not properly labeled with units. It could be misinterpreted as trade volume instead of trade amount.X-axis is clear.\r\nThere could be a short paragraph summarising the objectives of the visualisation. This might give the reader a clearer picture.\r\nThere could be annotations on the graph to highlight key observations.\r\n3.2. Aesthetics\r\nArea graph may not be the most appropriate chart. Due to the overlapping colours, it is difficult to visualise the export trends when its value falls below import value. A line graph might be more appropriate.\r\nUsage of colours in the chart is consistent, and easy to differentiate.\r\nThe legend (measures names) could be placed between the top and bottom row for better visualisations.\r\n4. Proposed Graphical Representation\r\n4.1. Sketch\r\nIn this section, I will proposed an alternative graphical representation of the data.\r\nFigure 2: Proposed Graphical Representation4.2. Advatanges of proposed design\r\nI have replaced the area graph with a line graph. This will allow better view of the data especially if there are any overlaps.\r\nThe y-axis of both imports and exports have the same interval. This will give a more accurate representation when comparing within and across the countries.\r\nDerived a new measure called net exports to understand if there are any trade deficit/surplus with certain countries. The data is aggregated by years to understand the change in net exports in 2019 and 2020.\r\n5. Step-by-step description for the makeover\r\nIn this section, I will be providing a step-by-step guide for the makeover in Tableau. I will make use of 2 tables:T1: Merchandise Imports By Region/Market, MonthlyT2: Merchandise Exports By Region/Market, Monthly\r\n5.1. Data Preparation (I)\r\nRemove the rows 1-5 from Excel T1 and T2 to facilitate upload onto Tableau.\r\nFigure 3: Removing unncessary rows from ExcelCreate a new Tableau Worksheet, and connect to the cleaned excel file.\r\nFigure 4: Connecting to data sourceThree tables corresponding to three worksheet is the excel is extracted.\r\nFigure 5: Connecting to data sourceDrag T1 into the workplace and the data points will be automatically populated.\r\nFigure 6: Configuring T1 - ImportsFilter the data based on the period (Jan 2019 - Dec 2020)\r\nFigure 7: Filter out the relevant periodPivot the data (except the first column) to get a thinner table suitable for visualisation. I have also renamed the 3 new columns as Period, Imports and Countries respectively.\r\nFigure 8: Pivot the tableChange the data type of the period from string to date\r\nFigure 9: Changing the data typeExtract the table and save it as T1(outputFile)\r\nFigure 10: Extract the tableRepeat the same process for T2, and save it as T2(outputFile)\r\n5.2. Data Preparation (II)\r\nOpen a new workbook and import T1(outputFile)\r\nFilter the data based on the countries (Hong Kong, China, Taiwan, US, Malaysia and Japan)\r\nFigure 11: Filter out the relevant countriesToggle to T2(OutputFile) and drag the table into the workspace. This creates a join between the two tables.\r\n 13. Rename the new fields accordingly. Period (Imports, Exports), Imports, Exports, Countries (Imports, Exports)\r\nClick on the join settings. Inner join is used on period and countries of both tables. \r\nCreate a new calculated field to convert imports and exports into billions scale. \r\n5.3. Creating Visualisations - Imports and Exports\r\nFirst, I will create 6 different line charts showcasing imports and exports on a dual axis. I will illustrate with Hong Kong.\r\nDrag Countries (Imports) into the filters workspace. Select Hong Kong from the filter pop-up. Repeat for Countries (Exports)\r\nFigure 15: Customising filter workspaceDrag other dimensions and measures into the columns and rows. For show both imports and exports as a single plot, right click on the exports plot and select “Dual Axis”.\r\nFigure 16: Creating the plotNext, customisation of the x and y-axis can be done by double clicking on the axis. This ensures consistency in the axis inttervals.\r\nFigure 17: Customising the y-axisFigure 18: Customising the x-axisRepeat the same steps for the remaining 5 countries in different worksheets.\r\n5.4. Creating Visualisations - Net Exports\r\nIn this section, we will be creating another visualisation that shows the net exports of the top six countries.\r\nI will first create a new measure called Net Exports.\r\nFigure 19: Creating a new measureA pop-up will appear. Key in “[Exports] - [Imports]” in the space provided to derive net exports.\r\nFigure 20: Entering formula for Net ExportsDrag dimensions and measures into the respective columns, rows, filters and marks. Note that the period is set to Year, to aggregate the net exports yearly.\r\n 25. Next, I have created a line chart to show the percentage of net exports aggregated by year. Similar to step 18, to choose dual-axis for the 2 graphs to overlap.\r\nFigure 22: Creating an additional line chartNext, I have created 2 more measures, to differentiate between positive net exports (trade surplus) and negative net exports (trade deficit). This is done by creating a new calculated field, and the IF function.\r\n 27. Finally, I have annotated the % change in net exports between 2019 and 2020.\r\nFigure 24: Creating additional measures for positive and negative differentiation5.5. Dashboarding - Putting everything together\r\nCreate new dashboard worksheet, and the individual charts created previously would appear on the left side Tableau.\r\nFigure 25: Creating the dashboardFor this dashboard, I have decided to use PowerPoint (1600 x 900) as the size and used the floating method to position the different visualisations.\r\nFigure 26: Setting the dashboardThe final layout of the dashboard is shown in Figure 20 below. The dashboard is also published on Tableau Public.\r\nFigure 27s: Final Dashboard6. Observations\r\nThere is an increase in net exports from 2019-2020 from China and United States. Upon closer inspection, it is noted the increase is due to the decreasing imports from these countries, while exports remained relatively stable (some seasonal fluctuations are observed). As Singapore is heavily dependent on imports for many commodities, it might be worth investigating the reasons.\r\nThere is a decrease in net exports from 2019-2020 from Malaysia and Japan, resulting in a larger proportion of trade deficit. Specifically for Malaysia, there is a dip in imports and exports in Apr 2020, which could account for a higher margin for the deficit.\r\nHong Kong records a significant level of trade surplus while Taiwan shows an opposite trend, a trade deficit. This has been rather consistent throughout 2019-2020. With regard to the trade deficit, it would place Singapore at a disadvantage in the long term. However, it could be positioned as an opportunity for Singapore to relook into country-specific strategies to strengthen international trade.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T18:49:44+08:00",
    "input_file": "DataVizMakeover1.knit.md"
  }
]
